vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5514_DFP.pdsc
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device_id=LPC5514, driver.lpc_dma.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=LPC5514, driver.lpc_dma.internal_condition">
      <require condition="device_id.LPC5514.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=LPC5514.internal_condition">
      <require condition="device_id.LPC5514.internal_condition"/>
    </condition>
    <condition id="device_ids.LPC5514.internal_condition">
      <accept Dname="LPC5514JBD100" Dvendor="NXP:11"/>
      <accept Dname="LPC5514JBD64" Dvendor="NXP:11"/>
      <accept Dname="LPC5514JEV59" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=LPC5514.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.LPC5514.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=LPC5514.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.LPC5514.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=LPC5514.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.LPC5514.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.component.usart_adapter, device_id=LPC5514, device.startup, driver.clock, driver.common, driver.flexcomm_i2c, driver.flexcomm_spi, driver.flexcomm_usart, driver.lpc_gpio, driver.lpc_iocon, driver.power, driver.reset, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.usart_adapter, device_id=LPC5514, device.startup, driver.clock, driver.common, driver.flexcomm_i2c, driver.flexcomm_spi, driver.flexcomm_usart, driver.lpc_gpio, driver.lpc_iocon, driver.power, driver.reset, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require condition="device_id.LPC5514.internal_condition"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
      <require condition="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition"/>
      <accept condition="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config"/>
    </condition>
    <condition id="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=LPC5514.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="LPC5514_system"/>
      <require condition="device.LPC5514.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=LPC5514.internal_condition"/>
    </condition>
