vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5514_DFP.pdsc
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.lpc_crc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.lpc_dma.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.lpc_gpio.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.lpc_iocon.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.lpc_rtc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.mcan.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.mrt.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.ostimer.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.pca9420.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, driver.power, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.flexcomm_i2c, driver.common, driver.power, device=LPC5514.internal_condition">
      <require condition="anyOf.driver.flexcomm_i2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="device.LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.pca9422.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, driver.power, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=LPC5514.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=LPC5514.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.flexcomm_i2c, driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.pint.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.plu.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.power.condition_id">
      <require condition="allOf.device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.device=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.rng_1.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.sctimer.condition_id">
      <require condition="allOf.driver.common, device_id=LPC5514.internal_condition"/>
    </condition>
    <condition id="driver.sgtl5000.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.sgtl_adapter, driver.codec, device=LPC5514.internal_condition"/>
    </condition>
